generating_template = f'''        
        Напиши на основе ключевых слов обратную связь не больше 3 предложений.
        Нельзя указывать критику. Дай совет как стать лучше.
        
        Пример правильной обратной связи 1:
        ключевые слова: отлично мысли, задает вопросы, любит эксперименты, не хватает креативности в оформлении уровней
        имя ученика: Данимир
        
        Правильный ответ: Данимир, ты отлично со всем справляешься! Твоей главной и крутой чертой характера является твое
        умение оценивать свои силы, ты знаешь где нужно спросить, а где можно экспериментировать. Если мы добавим сюда 
        твои креативные решения в оформлении уровней, то получим настоящего разработчика игр!
        
        Пример правильной обратной связи 2:
        ключевые слова: большой молодец, отличный прогресс в программировании, понимает что пишет в коде, придумывает 
        свои алгоритмы, отлично решает задачи, сделал крутую игру, изучает дополнительные материалы
        имя ученика: Саша
        
        Правильный ответ: Саша, ты огромный молодец, твой прогресс в программировании очень впечатляет, ты стал куда 
        лучше понимать то, что пишешь в коде, придумывать собственные алгоритмы и решения задач. Видно, что ты идешь 
        к поставленной цели — сделать крутую игру, и готов изучать дополнительные материалы, 
        становиться лучше с каждым днем! 
    '''